src/Documents/ОтчетФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтчетФО</Name>
			<Comment>для выгрузки в учетную базу</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНеплательщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасхода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКорр</Name>
					<Comment>Разница между суммой по заказам и суммой по протоколам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в ценах реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассоваяСмена</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Касса_ОткрытиеСмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорр</Name>
							<Comment>Разница между суммой по заказам и суммой по протоколам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеестрЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРасхода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСуммы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ОтчетФО/Forms/ФормаДокумента/module.bsl
// Переменные для оформления строк
Перем мЖелтыйЦвет;

Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = ЭлементыФормы.Товары.ТекущаяСтрока;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	Отбор.Вставить("ТипЦен", Справочники.ТипыЦен.Розничная);
	ТекущаяСтрока.Цена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Дата, Отбор).Цена;
	
	ТекущаяСтрока.Количество = 1;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена;
КонецПроцедуры

Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = ЭлементыФормы.Товары.ТекущаяСтрока;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = ЭлементыФормы.Товары.ТекущаяСтрока;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
КонецПроцедуры

Процедура ТоварыПриАктивизацииСтроки(Элемент)
	Строка = ЭлементыФормы.Товары.ТекущиеДанные;
	
	Если Строка <> Неопределено Тогда
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Значение 		= Строка.Идентификатор;
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Использование 	= Истина;
	КонецЕсли;
КонецПроцедуры

Процедура СпецификиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	// выделим специфики по текущем товару
	ТекДанныеТовары = ЭлементыФормы.Товары.ТекущиеДанные;
	Если НЕ ТекДанныеТовары = Неопределено И ТекДанныеТовары.Идентификатор = ДанныеСтроки.ИдентификаторТовара Тогда
		ОформлениеСтроки.ЦветФона = мЖелтыйЦвет;				
	КонецЕсли;		
КонецПроцедуры

Процедура ОбновлениеОтображения()
	СтраницаПанели = ЭлементыФормы.Панель.Страницы;
	СтраницаПанели.Товары.Заголовок = "Товары (" + Товары.Количество() + " поз.)";
	СтраницаПанели.Специфики.Заголовок = "Специфики (" + Специфики.Количество() + " поз.)";
	СтраницаПанели.ДеревоТоваров.Заголовок = "Товары (" + ДеревоТоваров.Строки.Количество() + " поз.)";
КонецПроцедуры

Процедура ПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = 2 Тогда
		ЭлементыФормы.Специфики.ОбновитьСтроки();
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	
	Пометка = ВосстановитьЗначение("ДеревоПометка");
	Если Не Пометка = Неопределено Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.Дерево.Пометка = Пометка;
	КонецЕсли;
	
	ЗаполнитьДеревоТоваров();
	УстановитьВидимостьКолонок();
	УправлениеДоступностью();
		
КонецПроцедуры

Процедура ПриЗакрытии()
	
	СохранитьЗначение("ДеревоПометка", ЭлементыФормы.ДействияФормы.Кнопки.Дерево.Пометка);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоТоваров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Количество,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СуммаБезСкидки,
	|	Товары.СуммаБонусов,
	|	Товары.Контрагент,
	|	Товары.ВариантОплаты,
	|	Товары.Идентификатор,
	|	Товары.ККМ,
	|	Товары.КассоваяСмена
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Номенклатура КАК Номенклатура,
	|	Таб.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Таб.Количество КАК Количество,
	|	Таб.Цена КАК Цена,
	|	Таб.Сумма КАК Сумма,
	|	Таб.СуммаБезСкидки КАК СуммаБезСкидки,
	|	Таб.СуммаБонусов КАК СуммаБонусов,
	|	Таб.Контрагент КАК Контрагент,
	|	Таб.ВариантОплаты КАК ВариантОплаты,
	|	Таб.Идентификатор КАК Идентификатор,
	|	Таб.ККМ,
	|	Таб.КассоваяСмена
	|ИЗ
	|	Таб КАК Таб
	|ИТОГИ
	|	СУММА(Количество),
	|	МАКСИМУМ(Цена),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезСкидки),
	|	СУММА(СуммаБонусов)
	|ПО
	|	Идентификатор";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	Выгрузка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерСтроки = 1;
	Для Каждого ИтоговаяСтрока Из Выгрузка.Строки Цикл
		СтрокаТЧ = ДеревоТоваров.Строки.Добавить();
		СтрокаТЧ.НомерСтроки = НомерСтроки;
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ИтоговаяСтрока);
		Если ИтоговаяСтрока.Строки.Количество() > 0 Тогда
			СтрокаТЧ.Номенклатура 		= ИтоговаяСтрока.Строки[0].Номенклатура;
			СтрокаТЧ.ЕдиницаИзмерения 	= ИтоговаяСтрока.Строки[0].ЕдиницаИзмерения;
			СтрокаТЧ.Контрагент			= ИтоговаяСтрока.Строки[0].Контрагент;
		КонецЕсли;
		Если ИтоговаяСтрока.Строки.Количество() > 1 Тогда
			Для Каждого Стр Из ИтоговаяСтрока.Строки Цикл
				НоваяСтрока = СтрокаТЧ.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);			
			КонецЦикла;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

// Управляет доступностью формы
//
Процедура УправлениеДоступностью()
	
	Если глВерсия < 2 Тогда
		ЭлементыФормы.Панель.Страницы.Специфики.Видимость = Ложь;
		ЭлементыФормы.Товары.Колонки.СуммаБонусов.Видимость = Ложь;
		ЭлементыФормы.Товары.Колонки.СуммаБонусов.Доступность = Ложь;
	КонецЕсли;
	
	Эл = ЭлементыФормы.ДеревоТоваров;
	Для Каждого Колонка Из Эл.Колонки Цикл
		Если Колонка.ЭлементУправления = Неопределено Тогда
			Продолжить;
		КонецЕсли;								
		Колонка.ЭлементУправления.ТолькоПросмотр 		= Истина;
		Колонка.ЭлементУправления.РедактированиеТекста 	= Ложь;			
	КонецЦикла;
	
	Если ЭлементыФормы.Панель.ТекущаяСтраница = ЭлементыФормы.Панель.Страницы.ДеревоТоваров Тогда
		ЭлементыФормы.ДействияФормы.Кнопки.Дерево.Пометка = Истина;
	КонецЕсли;
	УстановитьВидимостьЗакладок();		
	
КонецПроцедуры //УправлениеДоступностью()

Процедура УстановитьВидимостьКолонок()
	
	Если ТипРасхода = Перечисления.ТипыРасхода.Списание Тогда
		
		ТоварыКолонки = ЭлементыФормы.Товары.Колонки;
		ТоварыКолонки.Цена.Видимость 			= Ложь;
		ТоварыКолонки.Сумма.Видимость 			= Ложь;
		ТоварыКолонки.СуммаБезСкидки.Видимость 	= Ложь;
		ТоварыКолонки.СуммаБонусов.Видимость 	= Ложь;
		ТоварыКолонки.Контрагент.Видимость 		= Ложь;
		ТоварыКолонки.ВариантОплаты.Видимость 	= Ложь;
		
		ТоварыКолонки = ЭлементыФормы.ДеревоТоваров.Колонки;
		ТоварыКолонки.Цена.Видимость 			= Ложь;
		ТоварыКолонки.Сумма.Видимость 			= Ложь;
		ТоварыКолонки.СуммаБезСкидки.Видимость 	= Ложь;
		ТоварыКолонки.СуммаБонусов.Видимость 	= Ложь;
		ТоварыКолонки.Контрагент.Видимость 		= Ложь;
		ТоварыКолонки.ВариантОплаты.Видимость 	= Ложь;
		
		ЭлементыФормы.ПанельОсновные.Страницы.Дополнительно.Видимость = Ложь;
		ЭлементыФормы.ПанельОсновные.ОтображениеЗакладок = ОтображениеЗакладок.НеИспользовать;
		
	Иначе
		
		ТоварыКолонки = ЭлементыФормы.Товары.Колонки;
		ТоварыКолонки.Цена.Видимость 			= Истина;
		ТоварыКолонки.Сумма.Видимость 			= Истина;
		ТоварыКолонки.СуммаБезСкидки.Видимость 	= Истина;
		ТоварыКолонки.СуммаБонусов.Видимость 	= Истина;
		ТоварыКолонки.Контрагент.Видимость 		= Истина;
		ТоварыКолонки.ВариантОплаты.Видимость 	= Истина;
		
		ТоварыКолонки = ЭлементыФормы.ДеревоТоваров.Колонки;
		ТоварыКолонки.Цена.Видимость 			= Истина;
		ТоварыКолонки.Сумма.Видимость 			= Истина;
		ТоварыКолонки.СуммаБезСкидки.Видимость 	= Истина;
		ТоварыКолонки.СуммаБонусов.Видимость 	= Истина;
		ТоварыКолонки.Контрагент.Видимость 		= Истина;
		ТоварыКолонки.ВариантОплаты.Видимость 	= Истина;
		
		ЭлементыФормы.ПанельОсновные.Страницы.Дополнительно.Видимость = Истина;
		ЭлементыФормы.ПанельОсновные.ОтображениеЗакладок = ОтображениеЗакладок.Сверху;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействияФормыДерево(Кнопка)
	
	Кнопка.Пометка = Не Кнопка.Пометка;
	УстановитьВидимостьЗакладок();
	Если Кнопка.Пометка Тогда
		ЭлементыФормы.Панель.ТекущаяСтраница 					= ЭлементыФормы.Панель.Страницы.ДеревоТоваров;
	Иначе
		ЭлементыФормы.Панель.ТекущаяСтраница 					= ЭлементыФормы.Панель.Страницы.Товары;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура управляет видимостью закладок панели
Процедура УстановитьВидимостьЗакладок()
	
	Кнопка = ЭлементыФормы.ДействияФормы.Кнопки.Дерево;
	Если Кнопка.Пометка Тогда
		ЭлементыФормы.Панель.Страницы.ДеревоТоваров.Видимость 	= Истина;
		ЭлементыФормы.Панель.Страницы.Товары.Видимость 			= Ложь;
	Иначе
		ЭлементыФормы.Панель.Страницы.ДеревоТоваров.Видимость 	= Ложь;
		ЭлементыФормы.Панель.Страницы.Товары.Видимость 			= Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ТипРасходаПриИзменении(Элемент)
	УстановитьВидимостьКолонок();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Модифицированность Тогда
		РучноеИзменение = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "ПриНачалеРедактирования"
//
Процедура СпецификиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрТовары = ЭлементыФормы.Товары.ТекущиеДанные;
	Если СтрТовары = Неопределено Тогда
		Отказ = Истина;
		Предупреждение("Для ввода специфик необходимо указать товар.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрТовары.Номенклатура) Тогда
		Отказ = Истина;
		Предупреждение("Для ввода специфик необходимо указать товар.");
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ = ЭлементыФормы.Специфики.ТекущиеДанные;
	Если НоваяСтрока Тогда
		СтрокаТЧ.ИдентификаторТовара = ЭлементыФормы.Товары.ТекущиеДанные.Идентификатор;
	КонецЕсли;
	
	Если Копирование Тогда
		СтрокаТЧ.ИдентификаторТовара = 0;
	КонецЕсли;	
	
	
КонецПроцедуры


мЖелтыйЦвет = Новый Цвет(255,255,153);
